const timeline = [
  {
    title: "公元前522年(周景王二十三年)春，楚平王驱逐太子建、杀死太傅伍奢，伍奢之子伍子胥出奔吴国。",
    key: "BC522",
    abstract: "伍子胥出逃"
  },
  {
    title: "公元前519年(周敬王元年)七月，吴、楚战于鸡父（今河南固始县东南），楚军大败。吴王僚攻取楚国州来（今安徽凤台）。",
    key: "BC519",
    abstract: "吴王僚大败楚军"
  },
  {
    title: "公元前518年(周敬王二年)冬，楚平王派遣水师入侵吴国，与越军在豫章之纳会师。吴王僚发兵报复楚国，攻占巢、钟离。",
    key: "BC518",
    abstract: "吴楚乱战"
  },
  {
    title: "公元前515年(周敬王五年)春，吴王僚派遣公子掩馀、公子烛庸率军伐楚，包围潜地。楚国令尹囊瓦率军进抵沙纳，左尹伯邻宛、工尹寿率军救援潜地。夏，公子光指使专诸刺杀吴王僚。公子光自立为王，是为吴王阖间。",
    key: "BC515",
    abstract: "专诸刺杀吴王僚"
  }
]

export default timeline